astb_relise/src/Documents/МедицинскийОсмотр/МедицинскийОсмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МедицинскийОсмотр</name>
  <registerRecords>InformationRegister.МедицинскиеОсмотрыСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяОрганизация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМедосмотра</name>
    <type>
      <types>EnumRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедицинскойКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеНаМедицинскийОсмотр</name>
    <type>
      <types>DocumentRef.НаправлениеНаМедицинскийОсмотр</types>
    </type>
  </attributes>
  <attributes>
    <name>Противопоказания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеИОпасныеПроизводственныеФакторы</name>
    <attributes>
      <name>Фактор</name>
      <type>
        <types>CatalogRef.ВредныеИОпасныеПроизводственныеФакторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Противопоказания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеИОпасныеПроизводственныеРаботы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.ВредныеИОпасныеПроизводственныеРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Противопоказания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/НаправлениеНаМедицинскийОсмотр/НаправлениеНаМедицинскийОсмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаМедицинскийОсмотр</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяОрганизация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМедосмотра</name>
    <type>
      <types>EnumRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/МедицинскийОсмотр/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Объект.ВредныеИОпасныеПроизводственныеРаботы.Очистить();
	Объект.ВредныеИОпасныеПроизводственныеФакторы.Очистить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВА"

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Документы.МедицинскийОсмотр.ЗаполнитьТаблицыДокумента(ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
	ОбновитьЗаголовкиСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеИОпасныеПроизводственныеРаботыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеИОпасныеПроизводственныеФакторыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеНаМедицинскийОсмотрПриИзменении(Элемент)
	
	Объект.Сотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	
	//структура из направления
	ДанныеНаправления = ПолучитьДанныеНаправления(Объект.НаправлениеНаМедицинскийОсмотр);
	
	Объект.МедицинскаяОрганизация 	= ДанныеНаправления.МедицинскаяОрганизация;
	Объект.ВидМедосмотра 			= ДанныеНаправления.ВидМедосмотра;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНаправления(НаправлениеНаМедицинскийОсмотр)
	
	ДанныеНаправления = Новый Структура;
	ДанныеНаправления.Вставить("МедицинскаяОрганизация",?(ЗначениеЗаполнено(НаправлениеНаМедицинскийОсмотр),НаправлениеНаМедицинскийОсмотр.МедицинскаяОрганизация,Справочники.Контрагенты.ПустаяСсылка()));
	ДанныеНаправления.Вставить("ВидМедосмотра",			?(ЗначениеЗаполнено(НаправлениеНаМедицинскийОсмотр),НаправлениеНаМедицинскийОсмотр.ВидМедосмотра,Перечисления.ВидыМедосмотров.ПустаяСсылка()));
	
	Возврат ДанныеНаправления;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьМассивСотрудниковИзНаправления(НаправлениеНаМедицинскийОсмотр)
	
	Если НЕ ЗначениеЗаполнено(НаправлениеНаМедицинскийОсмотр) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Различные
	|	НаправлениеНаМедицинскийОсмотрРаботники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.НаправлениеНаМедицинскийОсмотр.Работники КАК НаправлениеНаМедицинскийОсмотрРаботники
	|ГДЕ
	|	НаправлениеНаМедицинскийОсмотрРаботники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",НаправлениеНаМедицинскийОсмотр);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции	

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ЗаполнитьНаСервере();
	
	ОбновитьЗаголовкиСтраниц();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Элементы.МедицинскаяОрганизация.Доступность = НЕ ЗначениеЗаполнено(Объект.НаправлениеНаМедицинскийОсмотр);
	Элементы.ВидМедосмотра.Доступность 			= НЕ ЗначениеЗаполнено(Объект.НаправлениеНаМедицинскийОсмотр);
	Элементы.Сотрудник.РежимВыбораИзСписка		= ЗначениеЗаполнено(Объект.НаправлениеНаМедицинскийОсмотр);
	
	Элементы.Сотрудник.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивСотрудниковИзНаправления(Объект.НаправлениеНаМедицинскийОсмотр));
	
	Если Объект.ВредныеИОпасныеПроизводственныеРаботы.Количество() + Объект.ВредныеИОпасныеПроизводственныеФакторы.Количество() = 0 Тогда
		Элементы.Противопоказания.Видимость = Истина;
	Иначе
		Элементы.Противопоказания.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьЗаголовкиСтраниц()
	
	Элементы.Страницы.ПодчиненныеЭлементы.ГруппаВредныеИОпасныеПроизводственныеРаботы.Заголовок 	= "Вредные и (или) опасные производственные работы (" + Объект.ВредныеИОпасныеПроизводственныеРаботы.Количество() + ")";
	Элементы.Страницы.ПодчиненныеЭлементы.ГруппаВредныеИОпасныеПроизводственныеФакторы.Заголовок 	= "Вредные и (или) опасные производственные факторы (" + Объект.ВредныеИОпасныеПроизводственныеФакторы.Количество() + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовкиСтраниц();
	
КонецПроцедуры
